// 1. Скрипт запрашивает ввести букву русского алфавита. Скрипт должен вывести сообщение какая эта буква - гласная или согласная - 10 баллов
// let letter = prompt("Ввести букву русского алфавита.");
// let letter1 = prompt(`какая эта буква - гласная или согласная: ${letter}`);
// alert(`Эта буква:"${letter}"- ${letter1}`);

// let letter = prompt("Введите букву");
// const vowels = ["а", "у", "о", "ы", "и", "э", "я", "ю", "ё", "е"];
// const consonants = [
//   "б",
//   "в",
//   "г",
//   "д",
//   "ж",
//   "з",
//   "й",
//   "к",
//   "л",
//   "м",
//   "н",
//   "п",
//   "р",
//   "с",
//   "т",
//   "ф",
//   "х",
//   "ц",
//   "ч",
//   "ш",
//   "щ",
// ];

// if (vowels.includes(letter)) {
//   alert(`Гласная буква`);
// }
// if (consonants.includes(letter)) {
//   alert(`Согласная буква`);
// }

// 2. “Калькулятор” - пользователь вводит с клавиатуры число, символ арифметического действия (+, -, *, /) и еще одно число, Скрипт должен вывести результат  - 10

// let num1 = +prompt("Первый операнд");
// let operator = prompt("Введите oператор:+, -, *, / ");
// let num2 = +prompt("Второй операнд");

// if (operator == "+") {
//   alert(num1 + num2);
// } else if (operator == "-") {
//   alert(num1 - num2);
// } else if (operator == "*") {
//   alert(num1 * num2);
// } else if (operator == "/") {
//   alert(num1 / num2);
// }
// 3. Вывести в консоль все возможные сочетания из двух цифр - первая цифра может быть любой от 3 до 8, вторая любой от 0 до 7. Пример: 36, 44, 80 и т.д
// let a = [3, 4, 5, 6, 7, 8];
// let b = [0, 1, 2, 3, 4, 5, 6, 7];

// for (let i = 0; i < a.length; i++) {
//   for (let j = 0; j < b.length; j++) {
//     console.log(`${a[i]}${b[j]}`);
//   }
// }
